Feature: Επεξεργασία των διευθύνσεων
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να αλλάξω ή να προσθέσω νέες διευθύνσεις  
		Θέλω να μπορώ να επεξεργαστώ τις διευθύνσεις στον λογαριασμό μου.
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα του λογαριασμού μου
	Scenario: Επιτυχής επεξεργασία των διευθύνσεων
		(When) Όταν πατήσω το κουμπί "Νέα Διεύθυνση"
		(And) Και πληκτρολογήσω σωστά τη νέα διεύθυνση μου
		(And) Και πατήσω το κουμπί "Αποθήκευση"
		(Then) Τότε θα πρέπει να γίνεται επιτυχής προσθήκη της διεύθυνσής μου
	Scenario: Ανεπιτυχής επεξεργασία των διευθύνσεων
		(When) Όταν πατήσω το κουμπί "Νέα Διεύθυνση"
		(When) Και πληκτρολογήσω λάθος τη διεύθυνση μου (τυπογραφικό λάθος και δεν υπάρχει στον χάρτη) ή αφήσω κάποιο πεδίο κενό
		(And) Και πατήσω το κουμπί "Αποθήκευση"
		(Then) Τότε θα πρέπει να γίνεται προσθήκη της διεύθυνσής μου
    		(And) Και να εμφανίζεται μήνυμα λάθους
