Feature: Επεξεργασία των διευθύνσεων
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να αλλάξω ή να προσθέσω νέες διευθύνσεις  
		Θέλω να μπορώ να επεξεργαστώ τις διευθύνσεις στον λογαριασμό μου.
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα του λογαριασμού μου
	Scenario: Επιτυχής επεξεργασία των διευθύνσεων
		(When) Όταν πληκτρολογήσω σωστά τις αλλαγές των διευθύνσεων μου
		(And) Και πατήσω το κουμπί "Αποθήκευση"
		(Then) Τότε θα πρέπει να γίνεται επιτυχής επεξεργασία των διευθύνσεων μου
	Scenario: Ανεπιτυχής επεξεργασία των διευθύνσεων
		(When) Όταν πληκτρολογήσω λάθος τις διευθύνσεις μου (τυπογραφικό λάθος και δεν υπάρχει στον χάρτη) ή αφήσω κάποιο πεδίο κενό
		(And) Και πατήσω το κουμπί "Αποθήκευση"
		(Then) Τότε θα πρέπει να γίνεται ανεπιτυχής επεξεργασία των διευθύνσεων μου
    		(And) Και να εμφανίζεται μήνυμα λάθους
