Feature: Προσθήκη στα αγαπημένα
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να έχω μια λίστα με τις προτιμήσεις μου
		Θέλω να μπορώ να κάνω προσθήκη ενός καταστήματος στα αγαπημένα μου
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα ενός καταστήματος
	Scenario: Επιτυχής προσθήκη στα αγαπημένα
		(When) Όταν πατήσω το κουμπί "Προσθήκη στα Αγαπημένα"
		(And) Και το κατάστημα δεν βρίσκεται ήδη στα "Αγαπημένα"
		(Then) Τότε θα πρέπει να εμφανίζεται ένα μήνυμα επιτυχούς προσθήκης
	Scenario: Ανεπιτυχής προσθήκη στα αγαπημένα
		(When) Όταν πατήσω το κουμπί "Προσθήκη στα Αγαπημένα"
		(And) Και το κατάστημα βρίσκεται ήδη στα "Αγαπημένα"
		(Then) Τότε θα πρέπει να εμφανίζεται ένα μήνυμα ανεπιτυχούς προσθήκης
    
