Feature: Προσθήκη στο καλάθι
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να διατηρώ μια λίστα με τα προϊόντα που έχω επιλέξει
		Θέλω να μπορώ να προσθέτω αντικείμενα στο καλάθι
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στη σελίδα παραγγελίας
		(And) Και έχω επιλέξει την καρτέλα του μενού ενός καταστήματος
	Scenario: Επιτυχής προσθήκη στο καλάθι
		(When) Όταν επιλέξω το προϊόν που θέλω
    		(And) Και πατήσω το κουμπί "Προσθήκη στο Καλάθι"
    		(And) Και το προϊόν είναι από το ίδιο κατάστημα
		(Then) Τότε θα πρέπει να γίνεται επιτυχής προσθήκη στο καλάθι
	Scenario: Επιτυχής πολλαπλή προσθήκη στο καλάθι
		(When) Όταν επιλέξω το προϊόν που θέλω
    		(And) Και πατήσω το κουμπί "Προσθήκη στο Καλάθι"
    		(And) Και το προϊόν είναι από το ίδιο κατάστημα
		(And) Και πατήσω το κουμπί "+"
		(Then) Τότε θα πρέπει να γίνεται επιτυχής πολλαπλή προσθήκη στο καλάθι
	Scenario: Ανεπιτυχής προσθήκη στο καλάθι
		(When)  Όταν επιλέξω το προϊόν που θέλω
    		(And) Και πατήσω το κουμπί "Προσθήκη στο Καλάθι"
    		(And) Και το προϊόν δεν είναι από το ίδιο κατάστημα
    		(Then) Τότε θα πρέπει να μην γίνεται επιτυχής προσθήκη στο καλάθι
	Scenario: Ανεπιτυχής προσθήκη στο καλάθι
		(When) Όταν επιλέξω το προϊόν που θέλω
    		(And) Και πατήσω το κουμπί "Προσθήκη στο Καλάθι"
    		(And) Και το προϊόν υπάρχει ήδη στο καλάθι
    		(Then) Τότε θα πρέπει να μην γίνεται επιτυχής προσθήκη στο καλάθι
