Feature: Προσθήκη στο καλάθι
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να διατηρώ μια λίστα με τα προϊόντα που έχω επιλέξει
		Θέλω να μπορώ να προσθέτω αντικείμενα στο καλάθι
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στο μενού ενός καταστήματος
	Scenario: Επιτυχής προσθήκη στο καλάθι
		(When) Όταν επιλέξω τα προϊόντα που θέλω
    		(And) Και πατήσω το κουμπί "Προσθήκη στο Καλάθι"
    		(And) Και τα προϊόντα είναι από το ίδιο κατάστημα
		(Then) Τότε θα πρέπει να εμφανίζει  ένα μήνυμα επιτυχούς προσθήκης στο καλάθι
	Scenario: Ανεπιτυχής προσθήκη στο καλάθι
		(When)  Όταν επιλέξω τα προϊόντα που θέλω
    		(And) Και πατήσω το κουμπί "Προσθήκη στο Καλάθι"
    		(And) Και τα προϊόντα δεν είναι από το ίδιο κατάστημα
    		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς προσθήκης στο καλάθι
	Scenario: Ανεπιτυχής προσθήκη στο καλάθι
		(When) Όταν επιλέξω τα προϊόντα που θέλω
    		(And) Και πατήσω το κουμπί "Προσθήκη στο Καλάθι"
    		(And) Και ένα από τα προϊόντα υπάρχει ήδη στο καλάθι
    		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς προσθήκης για το συγκεκριμένο προϊόν
