Feature: Προσθήκη σχόλιου
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να επιλέγω το τι θα περιέχουν τα προϊόντα
		Θέλω να μπορώ να προσθέτω σχόλια σε κάθε προϊόν στο καλάθι
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στη σελίδα παραγγελίας
		(And) Και έχω επιλέξει την καρτέλα του μενού ενός καταστήματος
	Scenario: Επιτυχής προσθήκη σχόλιου
		(When) Όταν επιλέξω το προϊόν που θέλω να σχολιάσω
    		(And) Και πατήσω το κουμπί "Προσθήκη σχόλιου"
    		(And) Και γράψω το σχόλιο που θέλω
                (And) Και πατήσω "enter"
		(Then) Τότε θα πρέπει να εμφανίζει  ένα μήνυμα επιτυχούς προσθήκης σχόλιου στο προϊόν
	Scenario: Ανεπιτυχής προσθήκη σχόλιου
		(When)  Όταν επιλέξω το προϊόν που θέλω να σχολιάσω
    		(And) Και πατήσω το κουμπί "Προσθήκη σχολίου"
    		(And) Και δεν γράψω κάποιο σχόλιο 
    		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς προσθήκης σχόλιου στο προϊόν
	Scenario: Ανεπιτυχής προσθήκη σχόλιου
		(When)  Όταν δεν επιλέξω κάποιο προϊόν 
    		(And) Και πατήσω το κουμπί "Προσθήκη σχόλιου"
    		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς προσθήκης σχόλιου
