Feature: Προσθήκη σχόλιου
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να επιλέγω το τι θα περιέχουν τα προϊόντα
		Θέλω να μπορώ να προσθέτω σχόλια σε κάθε προϊόν στο καλάθι
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στη σελίδα παραγγελίας
		(And) Και έχω επιλέξει την καρτέλα του μενού ενός καταστήματος
	Scenario: Επιτυχής προσθήκη σχόλιου
		(When) Όταν επιλέξω το προϊόν που θέλω
    		(And) Και επιλέξω την ειδική περιοχή προσθήκης σχολίου
    		(And) Και γράψω το σχόλιο που θέλω
                (And) Και πατήσω "Προσθήκη στο καλάθι"
		(Then) Τότε θα πρέπει να γίνεται επιτυχής προσθήκη του προϊόντος στο καλάθι μαζί με το σχόλιο

