Feature: Επεξεργασία των στοιχείων
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να αλλάξω τα στοιχεία μου  
		Θέλω να επεξεργαστώ τα στοιχεία στον λογαριασμό μου.
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα του λογαριασμού μου
	Scenario: Επιτυχής επεξεργασία των στοιχείων
		(When) Όταν πληκτρολογήσω σωστά το τις αλλαγές των στοιχείων μου
		(And) Και πατήσω το κουμπί "Αποθήκευση"
		(Then) Τότε θα πρέπει να γίνεται επιτυχής επεξεργασία των στοιχείων μου
	Scenario: Ανεπιτυχής επεξεργασία των στοιχείων
		(When) Όταν πληκτρολογήσω λάθος τα στοιχεία μου ή αφήσω κάποιο πεδίο κενό
		(And) Και πατήσω το κουμπί "Αποθήκευση"
		(Then) Τότε θα πρέπει να γίνεται ανεπιτυχής επεξεργασία των στοιχείων μου
(And) Και να εμφανίζεται μήνυμα λάθους
