Feature: Ολοκλήρωση παραγγελίας
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να παραλάβω τα προϊόντα που έχω επιλέξει
		Θέλω να μπορώ να ολοκλήρωσω την παραγγελία μου
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στη σελίδα του καλαθιού μου
	Scenario: Επιτυχής ολοκλήρωση παραγγελίας
		(When) Όταν πατήσω το κουμπί "Ολοκλήρωση Παραγγελίας"
    		(And) Και υπάρχουν προϊόντα στο καλάθι μου
    		(And) Και έχω επιλέξει τρόπο πληρωμής
                (And) Και στην καρτέλα τελικής επιβεβαίωσης που περίεχει όλα τα στοιχεία μου πατήσω "Συνέχεια"
		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα επιτυχούς ολοκλήρωσης της παραγγελίας
	Scenario: Ανεπιτυχής ολοκλήρωση παραγγελίας
		(When)  Όταν πατήσω το κουμπί "Ολοκλήρωση Παραγγελίας"
    		(And) Και υπάρχουν προϊόντα στο καλάθι μου
    		(And) Και δεν έχω επιλέξει τρόπο πληρωμής
    		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς ολοκλήρωσης της παραγγελίας
	Scenario: Ανεπιτυχής ολοκλήρωση παραγγελίας
		(When)  Όταν πατήσω το κουμπί "Ολοκλήρωση Παραγγελίας"
    		(And) Και δεν υπάρχουν προϊόντα στο καλάθι μου
                (Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς ολοκλήρωσης της παραγγελίας
