Feature: Ολοκλήρωση παραγγελίας
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να παραλάβω τα προϊόντα που έχω επιλέξει
		Θέλω να μπορώ να ολοκλήρωσω την παραγγελία μου
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στη σελίδα του καλαθιού μου
	Scenario: Επιτυχής ολοκλήρωση παραγγελίας
		(When) Όταν πατήσω το κουμπί "Συνέχεια Παραγγελίας"
    		(And) Και υπάρχουν προϊόντα στο καλάθι μου
		(Then) Τότε θα πρέπει να εμφανίζεται η σελίδα ολοκλήρωσης παραγγελίας
		(And) Και στην καρτέλα επιβεβαίωσης είναι συμπληρωμένα όλα τα στοιχεία 
    		(And) Και έχω επιλέξει τρόπο πληρωμής
                (And) Και πατήσω "Ολοκλήρωση Παραγγελίας"
		(Then) Τότε θα πρέπει να εμφανίζεται ένα μήνυμα επιτυχούς ολοκλήρωσης της παραγγελίας
	Scenario: Ανεπιτυχής ολοκλήρωση παραγγελίας
		(When)  Όταν πατήσω το κουμπί "Συνέχεια Παραγγελίας"
    		(And) Και υπάρχουν προϊόντα στο καλάθι μου
		(Then) Τότε θα πρέπει να εμφανίζεται η σελίδα ολοκλήρωσης παραγγελίας
		(And) Και στην καρτέλα επιβεβαίωσης είναι συμπληρωμένα όλα τα στοιχεία 
    		(And) Και δεν έχω επιλέξει τρόπο πληρωμής
                (And) Και πατήσω "Ολοκλήρωση Παραγγελίας"
    		(Then) Τότε θα πρέπει να εμφανίζεται ένα μήνυμα ανεπιτυχούς ολοκλήρωσης της παραγγελίας
	Scenario: Ανεπιτυχής ολοκλήρωση παραγγελίας
		(When)  Όταν πατήσω το κουμπί "Συνέχεια Παραγγελίας"
    		(And) Και δεν υπάρχουν προϊόντα στο καλάθι μου
                (Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς ολοκλήρωσης της παραγγελίας
	Scenario: Ανεπιτυχής ολοκλήρωση παραγγελίας
		(When)  Όταν πατήσω το κουμπί "Συνέχεια Παραγγελίας"
    		(And) Και υπάρχουν προϊόντα στο καλάθι μου
		(Then) Τότε θα πρέπει να εμφανίζεται η σελίδα ολοκλήρωσης παραγγελίας
		(And) Και στην καρτέλα επιβεβαίωσης δεν είναι συμπληρωμένα όλα τα στοιχεία 
    		(And) Και έχω επιλέξει τρόπο πληρωμής
                (And) Και πατήσω "Ολοκλήρωση Παραγγελίας"
    		(Then) Τότε θα πρέπει να εμφανίζεται ένα μήνυμα ανεπιτυχούς ολοκλήρωσης της παραγγελίας
