Feature: Τελευταίες παραγγελίες
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να βρίσκω γρήγορα τις τελευταίες προτιμήσεις μου
		Θέλω να μπορώ να βλέπω τις τελευταίες παραγγελίες μου
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην αρχική σελίδα
	Scenario: Επιτυχής εύρεση τελευταίων παραγγελιών
		(When) Όταν πατήσω το κουμπί "οι τελευταίες παραγγελίες μου"
		(Then) Τότε θα πρέπει να εμφανίζει μια λίστα με τις τελευταίες παραγγελίες μου
	Scenario: Ανεπιτυχής εύρεση παραγγελιών
		(When) Όταν πατήσω το κουμπί "οι τελευταίες παραγγελίες μου"
    (And) Και δεν έχω κάνει καμία παραγγελία από κατάστημα ακόμα
    (Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς εύρεσης
    
