Feature: Τελευταίες παραγγελίες
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να βρίσκω γρήγορα τις τελευταίες προτιμήσεις μου
		Θέλω να μπορώ να βλέπω τις τελευταίες παραγγελίες μου
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα του λογαριασμού μου
	Scenario: Επιτυχής εύρεση τελευταίων παραγγελιών
		(When) Όταν επιλέξω την καρτέλα "παραγγελίες"
		(Then) Τότε θα πρέπει να εμφανίζεται μια λίστα με τις τελευταίες παραγγελίες μου
	Scenario: Ανεπιτυχής εύρεση παραγγελιών
		(When) Όταν επιλέξω την καρτέλα "παραγγελίες"
    		(And) Και δεν έχω κάνει καμία παραγγελία από κατάστημα ακόμα
    		(Then) Τότε θα πρέπει να εμφανίζεται ένα μήνυμα ανεπιτυχούς εύρεσης
    
