Feature: Σύνδεση στο σύστημα
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να χρησιμοποιήσω την υπηρεσία  
		Θέλω να συνδεθώ στον λογαριασμό μου.
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην αρχική σελίδα
	Scenario: Επιτυχής σύνδεση στο σύστημα
		(When) Όταν πληκτρολογήσω σωστά το username και password
		(And) Και πατήσω το κουμπί "Σύνδεση"
		(Then) Τότε θα πρέπει να γίνεται επιτυχής σύνδεση στο σύστημα
	Scenario: Ανεπιτυχής σύνδεση στο σύστημα
		(When) Όταν πληκτρολογήσω λάθος το username ή password
		(And) Και πατήσω το κουμπί "Σύνδεση"
		(Then) Τότε θα πρέπει να γίνεται ανεπιτυχής σύνδεση στο σύστημα
		(And) Και να εμφανίζεται μήνυμα λάθους
