Feature: Παλιότερες παραγγελίες
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να ξέρω τι είχα πάρει παλιότερα από ένα κατάστημα
		Θέλω να μπορώ να βλέπω τις παραγγελίες μου
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα ενός καταστήματος
	Scenario: Επιτυχής εύρεση παραγγελιών
		(When) Όταν πατήσω το κουμπί "οι παραγγελίες μου"
		(Then) Τότε θα πρέπει να εμφανίζει μια λίστα με τις παλιότερες παραγγελίες μου
	Scenario: Ανεπιτυχής εύρεση παραγγελιών
		(When) Όταν πατήσω το κουμπί "οι παραγγελίες μου"
    		(And) Και δεν έχω κάνει παλιότερα παραγγελία στο συγκεκριμένο κατάστημα
    		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς εύρεσης
	
