Feature: Επιλογή τρόπου πληρωμής
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να ολοκληρώσω μια παραγγελία  
		Θέλω να μπορώ να επιλέξω τον τρόπο πληρωμής.
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα της παραγγελίας
	Scenario: Επιτυχής επιλογή τρόπου πληρωμής με μετρητά
		(When) Όταν επιλέξω ως τρόπο πληρωμής τα μετρητά
		(And) Και πατήσω το κουμπί "Συνέχεια"
		(Then) Τότε θα πρέπει να ολοκληρώνεται η παραγγελία
    (And) Και να εμφανίζεται μήνυμα ολοκλήρωσης της παραγγελίας
  Scenario: Επιτυχής επιλογή τρόπου πληρωμής με κάρτα
		(When) Όταν επιλέξω ως τρόπο πληρωμής την κάρτα
    (And) Και πληκτρολογήσω σωστά τα στοιχεία της κάρτας μου
    (And) Και υπάρχει διαθέσιμο υπόλοιπο στην κάρτα
		(And) Και πατήσω το κουμπί "Συνέχεια"
		(Then) Τότε θα πρέπει να ολοκληρώνεται η παραγγελία
    (And) Και να εμφανίζεται μήνυμα ολοκλήρωσης της παραγγελίας
	Scenario: Ανεπιτυχής επιλογή τρόπου πληρωμής με κάρτα
		(When) πληκτρολογήσω λάθος τα στοιχεία της κάρτας μου
		(And) Και πατήσω το κουμπί "Συνέχεια"
		(Then) Τότε θα πρέπει να γίνεται ανεπιτυχής επιλογή τρόπου πληρωμής
    (And) Και να εμφανίζεται μήνυμα λάθους
  Scenario: Ανεπιτυχής επιλογή τρόπου πληρωμής με κάρτα
		(When) πληκτρολογήσω σωστά τα στοιχεία της κάρτας μου
    (And) Και δεν υπάρχει διαθέσιμο υπόλοιπο στην κάρτα
		(And) Και πατήσω το κουμπί "Συνέχεια"
		(Then) Τότε θα πρέπει να γίνεται ανεπιτυχής επιλογή τρόπου πληρωμής
    (And) Και να εμφανίζεται μήνυμα λάθους
