Feature: Αφαίρεση από το καλάθι
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να διατηρώ στη λίστα με τα προϊόντα που έχω επιλέξει
                τα τελικά προϊόντα που θα αγοράσω
		Θέλω να μπορώ να αφαιρώ αντικείμενα από το καλάθι
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στη σελίδα του καλαθιού μου
	Scenario: Επιτυχής αφαίρεση από το καλάθι
		(When) Όταν επιλέξω τα προϊόντα που δεν θέλω να κρατήσω
    		(And) Και πατήσω το κουμπί "Αφαίρεση από το Καλάθι"
  		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα επιτυχούς αφαίρεσης από το καλάθι
	Scenario: Ανεπιτυχής αφαίρεση από το καλάθι
		(When)  Όταν δεν επιλέξω κάποιο προϊόν να αφαιρέσω
    		(And) Και πατήσω το κουμπί "Αφαίρεση από το Καλάθι"
    		(Then) Τότε θα πρέπει να εμφανίζει ένα μήνυμα ανεπιτυχούς αφαίρεσης από το καλάθι
	
