Feature: Αφαίρεση από το καλάθι
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να διατηρώ στη λίστα με τα προϊόντα που έχω επιλέξει
                τα τελικά προϊόντα που θα αγοράσω
		Θέλω να μπορώ να αφαιρώ αντικείμενα από το καλάθι
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στη σελίδα παραγγελίας ενός καταστήματος
	Scenario: Επιτυχής αφαίρεση από το καλάθι
		(When) Όταν επιλέξω τo προϊόν που δεν θέλω να κρατήσω
    		(And) Και πατήσω το κουμπί "-"
  		(Then) Τότε θα πρέπει να γίνεται επιτυχής μία αφαίρεση του προϊόντος από το καλάθι
	Scenario: Επιτυχής πολλαπλή αφαίρεση από το καλάθι
		(When) Όταν επιλέξω τo προϊόν που δεν θέλω να κρατήσω
    		(And) Και πατήσω το κουμπί "X"
    		(Then) Τότε θα πρέπει να γίνεται επιτυχής πολλαπλή αφαίρεση του προϊόντος από το καλάθι
	
