Feature: Εύρεση αξιολόγησης
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να ξέρω την άποψη άλλων χρηστών για το κάθε κατάστημα
		Θέλω να μπορώ να βλέπω τις αξιολογήσεις του κάθε καταστήματος
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα ενός καταστήματος
	Scenario: Επιτυχής εύρεση αξιολόγησης Καταστήματος
		(When) Όταν πατήσω το κουμπί "Αξιολόγηση Καταστήματος"
		(Then) Τότε θα πρέπει να βρίσκομαι στην σελίδα με την συνολική βαθμολογία αστεριών που έχει πάρει από τους χρήστες.
	Scenario: Επιτυχής εύρεση τοποθεσίας Καταστήματος
		(When) Όταν πατήσω το κουμπί "Σχόλια Χρηστών"
		(Then) Τότε θα πρέπει να βρίσκομαι στην σελίδα με τα σχόλια των χρηστών για το συγκεκριμμένο κατάστημα.
       
       
