Feature: Εύρεση αξιολόγησης
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να ξέρω την άποψη άλλων χρηστών για το κάθε κατάστημα
		Θέλω να μπορώ να βλέπω τις αξιολογήσεις του κάθε καταστήματος
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα παραγγελίας ενός καταστήματος
	Scenario: Επιτυχής εύρεση αξιολόγησης Καταστήματος
		(When) Όταν επιλέξω την καρτέλα "Αξιολογήσεις"
		(Then) Τότε θα πρέπει να βρίσκομαι στην σελίδα με την βαθμολογία αστεριών και τα σχόλια απο κάθε χρήστη.
	
       
