Feature: Εύρεση αγαπημένων
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να έχω γρήγορη πρόσβαση σε μια λίστα με τις προτιμήσεις μου
		Θέλω να μπορώ να βλέπω τα "αγαπημένα μου" καταστήματα
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα του λογαριασμού μου
	Scenario: Επιτυχής εύρεση αγαπημένων
		(When) Όταν επιλέξω την καρτέλα "Αγαπημένα"
		(And) Και η λίστα αυτή έχει τουλάχιστον ένα κατάστημα
		(Then) Τότε θα πρέπει να εμφανίζονται όλα τα καταστήματα στα οποία έχω πατήσει "Προσθήκη στα Αγαπημένα"
	Scenario: Ανεπιτυχής εύρεση αγαπημένων
		(When) Όταν επιλέξω την καρτέλα "Αγαπημένα"
		(And) Και η λίστα αυτή δεν έχει τουλάχιστον ένα κατάστημα
		(Then) Τότε θα πρέπει να εμφανίζονται ένα μήνυμα ότι η λίστα είναι άδεια
    
