Feature: Εγγραφή στο σύστημα
		Ως νέος χρήστης   
		Έτσι ώστε να μπορώ να χρησιμοποιώ την υπηρεσία  
		Θέλω να δημιουργήσω ένα λογαριασμό με τα στοιχεία μου.
	Background:
		(Given) Δεδομένου ότι βρίσκομαι στην αρχική σελίδα
	Scenario: Επιτυχής εγγραφή στο σύστημα
		(When) Όταν πατήσω το κουμπί "Εγγραφή"
		(Then) Τότε πρέπει να εμφανιστεί η σελίδα συμπλήρωσης στοιχείων
		(When) Συμπληρώσω όλα τα πεδία της σελίδας (Όνομα,Κωδικό)
		(Then) Τότε πρέπει  να γίνει επιτυχής εγγραφή στο σύστημα
	Scenario: Ανεπιτυχής εγγραφή στο σύστημα
		(When) Όταν πατήσω το κουμπί "Εγγραφή"
		(Then) Τότε πρέπει να εμφανιστεί η σελίδα συμπλήρωσης στοιχείων
		(When) Συμπληρώσω μερικά απο τα πεδία της σελίδας (Όνομα,Κωδικό)
		(Then) Τότε πρέπει να γίνει ανεπιτυχής εγγραφή στο σύστημα
		(And)  Και να εμφανιστεί μήνυμα λάθους
	Scenario: Ανεπιτυχής εγγραφή στο σύστημα
		(When) Όταν πατήσω το κουμπί "Εγγραφή"
		(Then) Τότε πρέπει να εμφανιστεί η σελίδα συμπλήρωσης στοιχείων
		(When) Όταν συμπληρώσω με λάθος χαρακτήρες τον κωδικό ή κάνω λάθος στην επανάληψη του
		(Then) Τότε πρέπει να γίνει ανεπιτυχής εγγραφή στο σύστημα
		(And)  Και να εμφανιστεί μήνυμα λάθους
