Feature: Εγγραφή στο σύστημα
	Background:
		(Given) Δεδομένου ότι βρίσκομαι στην αρχική σελίδα
	Scenario: Επιτυχής εγγραφή στο σύστημα
		(When) Όταν πατήσω το κουμπί "Εγγραφή"
		(Then) Τότε πρέπει να εμφανιστεί η σελίδα συμπλήρωσης στοιχείων
		(When) Συμπληρώσω όλα τα πεδία της σελίδας (Όνομα,Τηλέφωνο,Διεύθυνση,Κωδικό)
		(Then) Τότε πρέπει  να γίνει επιτυχής εγγραφή στο σύστημα
	Scenario: Ανεπιτυχής εγγραφή στο σύστημα
		(When) Όταν πατήσω το κουμπί "Εγγραφή"
		(Then) Τότε πρέπει να εμφανιστεί η σελίδα συμπλήρωσης στοιχείων
		(When) Συμπληρώσω μερικά απο τα πεδία της σελίδας (Όνομα,Τηλέφωνο,Διεύθυνση,Κωδικό)
		(Then) Τότε πρέπει να γίνει ανεπιτυχής εγγραφή στο σύστημα
		(And)  Και να εμφανιστεί μήνυμα λάθους
