Feature: Ταξινόμηση καταστημάτων
		Ως εγγεγραμένος χρήστης   
		Έτσι ώστε να μπορώ να συγκρίνω τα καταστήματα ανάλογα με το κόστος ελάχιστης παραγγελίας, τον εκτιμώμενο χρόνο παράδοσης της παραγγελίας και τις αξιολογήσεις άλλων χρηστών 
		Θέλω να μπορώ να ταξινομώ τα καταστήματα
	Background:
		(Given) Δεδομένου ότι έχω εγγραφεί στο σύστημα
		(And) Και βρίσκομαι στην σελίδα των καταστημάτων
	Scenario: Επιτυχής ταξινόμηση καταστημάτων
		(When) Όταν επιλέξω την ταξινόμηση που θέλω να κάνω
		(And) Και πατήσω πάνω στο όνομα του αντίστοιχου φίλτρου
		(Then) Τότε θα πρέπει να γίνεται επιτυχής ταξινόμηση με βάση το φίλτρο που διάλεξα
	
  
